RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/MCXA156/MCXA156/drivers/fsl_clock.h
    kFRO12M_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 0U),      /*!< Attach FRO12M to CLKOUT.     */
    kFRO_HF_DIV_to_CLKOUT = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 1U),      /*!< Attach FRO_HF_DIV to CLKOUT. */
    kCLK_IN_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 2U),      /*!< Attach CLK_IN to CLKOUT.     */
    kCLK_16K_to_CLKOUT    = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 3U),      /*!< Attach CLK_16K to CLKOUT.    */
    kSLOW_CLK_to_CLKOUT   = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 6U),      /*!< Attach SLOW_CLK to CLKOUT.   */
    kNONE_to_CLKOUT       = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 7U),      /*!< Attach NONE to CLKOUT.       */

    kCPU_CLK_to_SYSTICK = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 0U),       /*!< Attach CPU_CLK to SYSTICK. */
    kCLK_1M_to_SYSTICK  = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 1U),       /*!< Attach CLK_1M to SYSTICK.  */
    kCLK_16K_to_SYSTICK = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 2U),       /*!< Attach CLK_16K to SYSTICK. */
    kNONE_to_SYSTICK    = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 3U),       /*!< Attach NONE to SYSTICK.    */

    kNONE_to_NONE = (0xFFFFFFFFU),                                     /*!< Attach NONE to NONE. */

} clock_attach_id_t;

/*! @brief Clock dividers */
typedef enum _clock_div_name
{
    kCLOCK_DivI3C0_FCLK  = (0x0A4),  /*!< I3C0_FCLK  clock divider */
    kCLOCK_DivCTIMER0    = (0x0AC),  /*!< CTIMER0    clock divider */
    kCLOCK_DivCTIMER1    = (0x0B4),  /*!< CTIMER1    clock divider */
    kCLOCK_DivCTIMER2    = (0x0BC),  /*!< CTIMER2    clock divider */
    kCLOCK_DivCTIMER3    = (0x0C4),  /*!< CTIMER3    clock divider */
    kCLOCK_DivCTIMER4    = (0x0CC),  /*!< CTIMER4    clock divider */
    kCLOCK_DivWWDT0      = (0x0D4),  /*!< WWDT0      clock divider */
    kCLOCK_DivFLEXIO0    = (0x0DC),  /*!< FLEXIO0    clock divider */
    kCLOCK_DivLPI2C0     = (0x0E4),  /*!< LPI2C0     clock divider */
    kCLOCK_DivLPI2C1     = (0x0EC),  /*!< LPI2C1     clock divider */
    kCLOCK_DivLPSPI0     = (0x0F4),  /*!< LPSPI0     clock divider */
    kCLOCK_DivLPSPI1     = (0x0FC),  /*!< LPSPI1     clock divider */
    kCLOCK_DivLPUART0    = (0x104),  /*!< LPUART0    clock divider */
    kCLOCK_DivLPUART1    = (0x10C),  /*!< LPUART1    clock divider */
    kCLOCK_DivLPUART2    = (0x114),  /*!< LPUART2    clock divider */
    kCLOCK_DivLPUART3    = (0x11C),  /*!< LPUART3    clock divider */
    kCLOCK_DivLPUART4    = (0x124),  /*!< LPUART4    clock divider */
    kCLOCK_DivLPTMR0     = (0x134),  /*!< LPTMR0     clock divider */
    kCLOCK_DivADC0       = (0x144),  /*!< ADC0       clock divider */
    kCLOCK_DivADC1       = (0x14C),  /*!< ADC1       clock divider */
    kCLOCK_DivCMP0_FUNC  = (0x154),  /*!< CMP0_FUNC  clock divider */
    kCLOCK_DivCMP0_RR    = (0x15C),  /*!< CMP0_RR    clock divider */
    kCLOCK_DivCMP1_FUNC  = (0x164),  /*!< CMP1_FUNC  clock divider */
    kCLOCK_DivCMP1_RR    = (0x16C),  /*!< CMP1_RR    clock divider */
    kCLOCK_DivDAC0       = (0x174),  /*!< DAC0       clock divider */
    kCLOCK_DivFLEXCAN0   = (0x17C),  /*!< FLEXCAN0   clock divider */
    kCLOCK_DivLPI2C2     = (0x184),  /*!< LPI2C2     clock divider */
    kCLOCK_DivLPI2C3     = (0x18C),  /*!< LPI2C3     clock divider */
    kCLOCK_DivDBG_TRACE  = (0x194),  /*!< DBG_TRACE  clock divider */
    kCLOCK_DivTRACE      = (0x194),  /*!< DBG_TRACE  clock divider */
    kCLOCK_DivCLKOUT     = (0x19C),  /*!< CLKOUT     clock divider */
    kCLOCK_DivSYSTICK    = (0x1A4),  /*!< SYSTICK    clock divider */
    kCLOCK_DivFRO_HF_DIV = (0x1AC),  /*!< FRO_HF_DIV clock divider */
    kCLOCK_DivSLOWCLK    = (0x378U), /*!< SLOWCLK    clock divider */
    kCLOCK_DivAHBCLK     = (0x380U), /*!< System     clock divider */
    kCLOCK_DivMax        = (0x380U), /*!< MAX        clock divider */
} clock_div_name_t;

/*!
 * @brief firc trim mode.
 */
typedef enum _firc_trim_mode
{
    kSCG_FircTrimNonUpdate = SCG_FIRCCSR_FIRCTREN_MASK,
    /*!< Trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref firc_trim_config_t.*/

    kSCG_FircTrimUpdate = SCG_FIRCCSR_FIRCTREN_MASK | SCG_FIRCCSR_FIRCTRUP_MASK
    /*!< Trim enable and trim value update enable. In this mode, the trim
     value is auto update. */

} firc_trim_mode_t;

/*!
 * @brief firc trim source.
 */
typedef enum _firc_trim_src
{
    kSCG_FircTrimSrcUsb0   = 0U, /*!< USB0 start of frame (1kHz). */
    kSCG_FircTrimSrcSysOsc = 2U, /*!< System OSC.                 */
} firc_trim_src_t;

/*!
 * @brief firc trim configuration.
 */
typedef struct _firc_trim_config
{
    firc_trim_mode_t trimMode; /*!< Trim mode. */
    firc_trim_src_t trimSrc;   /*!< Trim source. */
    uint16_t trimDiv;          /*!< Divider of SOSC. */
    uint8_t trimCoar;          /*!< Trim coarse value; Irrelevant if trimMode is kSCG_TrimUpdate. */
    uint8_t trimFine;          /*!< Trim fine value; Irrelevant if trimMode is kSCG_TrimUpdate. */
} firc_trim_config_t;

/*!
 * @brief sirc trim mode.
 */
typedef enum _sirc_trim_mode
{
    kSCG_SircTrimNonUpdate = SCG_SIRCCSR_SIRCTREN_MASK,
    /*!< Trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref sirc_trim_config_t.*/

    kSCG_SircTrimUpdate = SCG_SIRCCSR_SIRCTREN_MASK | SCG_SIRCCSR_SIRCTRUP_MASK
    /*!< Trim enable and trim value update enable. In this mode, the trim
     value is auto update. */

} sirc_trim_mode_t;

/*!
 * @brief sirc trim source.
 */
typedef enum _sirc_trim_src
{
    kNoTrimSrc             = 0,  /*!< No external tirm source.    */
    kSCG_SircTrimSrcSysOsc = 2U, /*!< System OSC.                 */
} sirc_trim_src_t;

/*!
 * @brief sirc trim configuration.
 */
typedef struct _sirc_trim_config
{
    sirc_trim_mode_t trimMode; /*!< Trim mode.       */
    sirc_trim_src_t trimSrc;   /*!< Trim source.     */
    uint16_t trimDiv;          /*!< Divider of SOSC. */
    uint8_t cltrim;            /*!< Trim coarse value; Irrelevant if trimMode is kSCG_TrimUpdate. */
    uint8_t ccotrim;           /*!< Trim fine value; Irrelevant if trimMode is kSCG_TrimUpdate. */
} sirc_trim_config_t;

/*!
 * @brief SCG system OSC monitor mode.
 */
typedef enum _scg_sosc_monitor_mode
{
    kSCG_SysOscMonitorDisable = 0U,                         /*!< Monitor disabled. */
    kSCG_SysOscMonitorInt     = SCG_SOSCCSR_SOSCCM_MASK,    /*!< Interrupt when the SOSC error is detected. */
    kSCG_SysOscMonitorReset =
        SCG_SOSCCSR_SOSCCM_MASK | SCG_SOSCCSR_SOSCCMRE_MASK /*!< Reset when the SOSC error is detected.     */
} scg_sosc_monitor_mode_t;

/*!
 * @brief firc trim source.
 */
typedef enum _clke_16k
{
    kCLKE_16K_SYSTEM   = VBAT_FROCLKE_CLKE(1U), /*!< To VSYS domain.     */
    kCLKE_16K_COREMAIN = VBAT_FROCLKE_CLKE(2U)  /*!< To VDD_CORE domain. */
} clke_16k_t;

